/****************** (C) COPYRIGHT 2011 BroadVision.Co.Ltd ******************
 *
 * 作者       : 孙劲飞
 * 版本       : V0.1
 * 创建日期   : 2011-11-16
 * 描述       : 驱动类头文件
 *
 ****************************************************************************/


#ifndef DRIVER_H_
#define DRIVER_H_

class Device;

class Driver {
public:
	typedef void (*irqCB_t)(void);

	Driver(void);
	virtual ~Driver();

	/****************************************************************************
	 * 简介   :	初始化函数。所有驱动必须重载该函数，并在该函数内完成初始化，而不
	 * 			应该在构造函数内完成初始化。
	 * 返回值 :	0	成功
	 * 			非0	失败
	 * 描述   :
	 ****************************************************************************/
	virtual int init(void) = 0;
protected:
};

#endif /* DRIVER_H_ */
